zephyrproject-rtos/zephyr/drivers/spi/spi_ll_stm32.c
	return 0;
}

static int spi_stm32_release(const struct device *dev,
			     const struct spi_config *config)
{
	struct spi_stm32_data *data = dev->data;
	const struct spi_stm32_config *cfg = dev->config;

	spi_context_unlock_unconditionally(&data->ctx);
	ll_func_disable_spi(cfg->spi);

	return 0;
}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
static int32_t spi_stm32_count_bufset_frames(const struct spi_config *config,
					     const struct spi_buf_set *bufs)
{
	if (bufs == NULL) {
		return 0;
	}

	uint32_t num_bytes = 0;

	for (size_t i = 0; i < bufs->count; i++) {
		num_bytes += bufs->buffers[i].len;
	}

	uint8_t bytes_per_frame = SPI_WORD_SIZE_GET(config->operation) / 8;

	if ((num_bytes % bytes_per_frame) != 0) {
		return -EINVAL;
	}

	int frames = num_bytes / bytes_per_frame;

	if (frames > UINT16_MAX) {
		return -EMSGSIZE;
	}

	return frames;
}

static int32_t spi_stm32_count_total_frames(const struct spi_config *config,
					    const struct spi_buf_set *tx_bufs,
					    const struct spi_buf_set *rx_bufs)
{
	int tx_frames = spi_stm32_count_bufset_frames(config, tx_bufs);

	if (tx_frames < 0) {
		return tx_frames;
	}

	int rx_frames = spi_stm32_count_bufset_frames(config, rx_bufs);

	if (rx_frames < 0) {
		return rx_frames;
	}

	return MAX(rx_frames, tx_frames);
}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

static int spi_stm32_half_duplex_switch_to_receive(const struct spi_stm32_config *cfg,
	struct spi_stm32_data *data)
{
	SPI_TypeDef *spi = cfg->spi;

	if (!spi_context_tx_on(&data->ctx) &&
		spi_context_rx_on(&data->ctx)) {
#ifndef CONFIG_SPI_STM32_INTERRUPT
		while (ll_func_spi_is_busy(spi)) {
			/* NOP */
		}
		LL_SPI_Disable(spi);
#endif /* CONFIG_SPI_STM32_INTERRUPT*/

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		const struct spi_config *config = data->ctx.config;

		if (SPI_OP_MODE_GET(config->operation) == SPI_OP_MODE_MASTER) {
			int num_bytes = spi_context_total_rx_len(&data->ctx);
			uint8_t bytes_per_frame = SPI_WORD_SIZE_GET(config->operation) / 8;

			if ((num_bytes % bytes_per_frame) != 0) {
				return -EINVAL;
			}

			LL_SPI_SetTransferSize(spi, (uint32_t) num_bytes / bytes_per_frame);
		}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

		LL_SPI_SetTransferDirection(spi, LL_SPI_HALF_DUPLEX_RX);

		LL_SPI_Enable(spi);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		/* With the STM32MP1, STM32U5 and the STM32H7,
		 * if the device is the SPI master,
		 * we need to enable the start of the transfer with
		 * LL_SPI_StartMasterTransfer(spi).
		 */
		if (LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER) {
			LL_SPI_StartMasterTransfer(spi);
			while (!LL_SPI_IsActiveMasterTransfer(spi)) {
				/* NOP */
			}
		}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

#if CONFIG_SOC_SERIES_STM32H7X
		/*
		 * Add a small delay after enabling to prevent transfer stalling at high
		 * system clock frequency (see errata sheet ES0392).
		 */
		k_busy_wait(WAIT_1US);
#endif

#ifdef CONFIG_SPI_STM32_INTERRUPT
#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		if (cfg->fifo_enabled) {
			LL_SPI_EnableIT_EOT(spi);
		}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

		ll_func_enable_int_errors(spi);
		ll_func_enable_int_rx_not_empty(spi);
#endif /* CONFIG_SPI_STM32_INTERRUPT */
	}

	return 0;
}

static int transceive(const struct device *dev,
		      const struct spi_config *config,
		      const struct spi_buf_set *tx_bufs,
		      const struct spi_buf_set *rx_bufs,
		      bool asynchronous,
		      spi_callback_t cb,
		      void *userdata)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	SPI_TypeDef *spi = cfg->spi;
	int ret;

	if (!tx_bufs && !rx_bufs) {
		return 0;
	}

#ifndef CONFIG_SPI_STM32_INTERRUPT
	if (asynchronous) {
		return -ENOTSUP;
	}
#endif /* CONFIG_SPI_STM32_INTERRUPT */

	spi_context_lock(&data->ctx, asynchronous, cb, userdata, config);

	spi_stm32_pm_policy_state_lock_get(dev);

	ret = spi_stm32_configure(dev, config, tx_bufs != NULL);
	if (ret) {
		goto end;
	}

	/* Set buffers info */
	if (SPI_WORD_SIZE_GET(config->operation) == 8) {
		spi_context_buffers_setup(&data->ctx, tx_bufs, rx_bufs, 1);
	} else {
		spi_context_buffers_setup(&data->ctx, tx_bufs, rx_bufs, 2);
	}

	uint32_t transfer_dir = LL_SPI_GetTransferDirection(spi);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (cfg->fifo_enabled && SPI_OP_MODE_GET(config->operation) == SPI_OP_MODE_MASTER) {
		int total_frames;

		if (transfer_dir == LL_SPI_FULL_DUPLEX) {
			total_frames = spi_stm32_count_total_frames(
				config, tx_bufs, rx_bufs);
		} else if (transfer_dir == LL_SPI_HALF_DUPLEX_TX) {
			total_frames = spi_stm32_count_bufset_frames(
				config, tx_bufs);
		} else {
			total_frames = spi_stm32_count_bufset_frames(
				config, rx_bufs);
		}

		if (total_frames < 0) {
			ret = total_frames;
			goto end;
		}
		LL_SPI_SetTransferSize(spi, (uint32_t)total_frames);
	}

#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

	LL_SPI_Enable(spi);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	/* With the STM32MP1, STM32U5 and the STM32H7,
	 * if the device is the SPI master,
	 * we need to enable the start of the transfer with
	 * LL_SPI_StartMasterTransfer(spi)
	 */
	if (LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER) {
		LL_SPI_StartMasterTransfer(spi);
		while (!LL_SPI_IsActiveMasterTransfer(spi)) {
			/* NOP */
		}
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

#ifdef CONFIG_SOC_SERIES_STM32H7X
	/*
	 * Add a small delay after enabling to prevent transfer stalling at high
	 * system clock frequency (see errata sheet ES0392).
	 */
	k_busy_wait(WAIT_1US);
#endif /* CONFIG_SOC_SERIES_STM32H7X */

	/* This is turned off in spi_stm32_complete(). */
	spi_stm32_cs_control(dev, true);

#ifdef CONFIG_SPI_STM32_INTERRUPT

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (cfg->fifo_enabled) {
		LL_SPI_EnableIT_EOT(spi);
	}
#endif /* DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi) */

	ll_func_enable_int_errors(spi);

	if (rx_bufs) {
		ll_func_enable_int_rx_not_empty(spi);
	}

