zephyrproject-rtos/zephyr/drivers/spi/spi_ll_stm32.c
	ll_func_enable_int_tx_empty(spi);

	do {
		ret = spi_context_wait_for_completion(&data->ctx);

		if (!ret &&
			transfer_dir == LL_SPI_HALF_DUPLEX_TX) {
			ret = spi_stm32_half_duplex_switch_to_receive(cfg, data);
			transfer_dir = LL_SPI_GetTransferDirection(spi);
		}
	} while (!ret && spi_stm32_transfer_ongoing(data));
#else /* CONFIG_SPI_STM32_INTERRUPT */
	do {
		ret = spi_stm32_shift_frames(cfg, data);

		if (!ret &&
			transfer_dir == LL_SPI_HALF_DUPLEX_TX) {
			ret = spi_stm32_half_duplex_switch_to_receive(cfg, data);
			transfer_dir = LL_SPI_GetTransferDirection(spi);
		}
	} while (!ret && spi_stm32_transfer_ongoing(data));

	spi_stm32_complete(dev, ret);

#ifdef CONFIG_SPI_SLAVE
	if (spi_context_is_slave(&data->ctx) && !ret) {
		ret = data->ctx.recv_frames;
	}
#endif /* CONFIG_SPI_SLAVE */

#endif /* CONFIG_SPI_STM32_INTERRUPT */

end:
	spi_context_release(&data->ctx, ret);

	return ret;
}

#ifdef CONFIG_SPI_STM32_DMA

static int wait_dma_rx_tx_done(const struct device *dev)
{
	struct spi_stm32_data *data = dev->data;
	int res = -1;
	k_timeout_t timeout;

	/*
	 * In slave mode we do not know when the transaction will start. Hence,
	 * it doesn't make sense to have timeout in this case.
	 */
	if (IS_ENABLED(CONFIG_SPI_SLAVE) && spi_context_is_slave(&data->ctx)) {
		timeout = K_FOREVER;
	} else {
		timeout = K_MSEC(1000);
	}

	while (1) {
		res = k_sem_take(&data->status_sem, timeout);
		if (res != 0) {
			return res;
		}

		if (data->status_flags & SPI_STM32_DMA_ERROR_FLAG) {
			return -EIO;
		}

		if (data->status_flags & SPI_STM32_DMA_DONE_FLAG) {
			return 0;
		}
	}

	return res;
}

#ifdef CONFIG_DCACHE
static bool buf_in_nocache(uintptr_t buf __maybe_unused, size_t len_bytes __maybe_unused)
{
	bool buf_within_nocache = false;

#ifdef CONFIG_NOCACHE_MEMORY
	/* Check if buffer is in nocache region defined by the linker */
	buf_within_nocache = (buf >= ((uintptr_t)_nocache_ram_start)) &&
		((buf + len_bytes - 1) <= ((uintptr_t)_nocache_ram_end));
	if (buf_within_nocache) {
		return true;
	}
#endif /* CONFIG_NOCACHE_MEMORY */

#ifdef CONFIG_MEM_ATTR
	/* Check if buffer is in nocache memory region defined in DT */
	buf_within_nocache = mem_attr_check_buf(
		(void *)buf, len_bytes, DT_MEM_ARM(ATTR_MPU_RAM_NOCACHE)) == 0;
#endif /* CONFIG_MEM_ATTR */

	return buf_within_nocache;
}

static bool is_dummy_buffer(const struct spi_buf *buf)
{
	return buf->buf == NULL;
}

static bool spi_buf_set_in_nocache(const struct spi_buf_set *bufs)
{
	for (size_t i = 0; i < bufs->count; i++) {
		const struct spi_buf *buf = &bufs->buffers[i];

		if (!is_dummy_buffer(buf) &&
				!buf_in_nocache((uintptr_t)buf->buf, buf->len)) {
			return false;
		}
	}
	return true;
}
#endif /* CONFIG_DCACHE */

static int transceive_dma(const struct device *dev,
		      const struct spi_config *config,
		      const struct spi_buf_set *tx_bufs,
		      const struct spi_buf_set *rx_bufs,
		      bool asynchronous,
		      spi_callback_t cb,
		      void *userdata)
{
	const struct spi_stm32_config *cfg = dev->config;
	struct spi_stm32_data *data = dev->data;
	SPI_TypeDef *spi = cfg->spi;
	int ret;
	int err;

	if (!tx_bufs && !rx_bufs) {
		return 0;
	}

	if (asynchronous) {
		return -ENOTSUP;
	}

#ifdef CONFIG_DCACHE
	if ((tx_bufs != NULL && !spi_buf_set_in_nocache(tx_bufs)) ||
		(rx_bufs != NULL && !spi_buf_set_in_nocache(rx_bufs))) {
		return -EFAULT;
	}
#endif /* CONFIG_DCACHE */

	spi_context_lock(&data->ctx, asynchronous, cb, userdata, config);

	spi_stm32_pm_policy_state_lock_get(dev);

	k_sem_reset(&data->status_sem);

	ret = spi_stm32_configure(dev, config, tx_bufs != NULL);
	if (ret) {
		goto end;
	}

	uint32_t transfer_dir = LL_SPI_GetTransferDirection(spi);

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	if (transfer_dir == LL_SPI_HALF_DUPLEX_RX) {
		int frames = spi_stm32_count_bufset_frames(config, rx_bufs);

		if (frames < 0) {
			ret = frames;
			goto end;
		}

		LL_SPI_SetTransferSize(cfg->spi, frames);
	}
#endif /* st_stm32h7_spi */

	/* Set buffers info */
	if (SPI_WORD_SIZE_GET(config->operation) == 8) {
		spi_context_buffers_setup(&data->ctx, tx_bufs, rx_bufs, 1);
	} else {
		spi_context_buffers_setup(&data->ctx, tx_bufs, rx_bufs, 2);
	}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
	/* set request before enabling (else SPI CFG1 reg is write protected) */
	if (transfer_dir == LL_SPI_FULL_DUPLEX) {
		LL_SPI_EnableDMAReq_RX(spi);
		LL_SPI_EnableDMAReq_TX(spi);
	} else if (transfer_dir == LL_SPI_HALF_DUPLEX_TX) {
		LL_SPI_EnableDMAReq_TX(spi);
	} else {
		LL_SPI_EnableDMAReq_RX(spi);
	}

	LL_SPI_Enable(spi);

	/* In half-duplex rx mode, start transfer after
	 * setting DMA configurations
	 */
	if (transfer_dir != LL_SPI_HALF_DUPLEX_RX &&
		LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER) {
		LL_SPI_StartMasterTransfer(spi);
	}
#else
	LL_SPI_Enable(spi);
#endif /* st_stm32h7_spi */

	/* This is turned off in spi_stm32_complete(). */
	spi_stm32_cs_control(dev, true);

	while (data->ctx.rx_len > 0 || data->ctx.tx_len > 0) {
		size_t dma_len;

		data->status_flags = 0;

		if (transfer_dir == LL_SPI_FULL_DUPLEX) {
			if (data->ctx.rx_len == 0) {
				dma_len = data->ctx.tx_len;
			} else if (data->ctx.tx_len == 0) {
				dma_len = data->ctx.rx_len;
			} else {
				dma_len = MIN(data->ctx.tx_len, data->ctx.rx_len);
			}

			ret = spi_dma_move_buffers(dev, dma_len);
		} else if (transfer_dir == LL_SPI_HALF_DUPLEX_TX) {
			dma_len = data->ctx.tx_len;
			ret = spi_dma_move_tx_buffers(dev, dma_len);
		} else {
			dma_len = data->ctx.rx_len;
			ret = spi_dma_move_rx_buffers(dev, dma_len);
		}

#if DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)
		if (transfer_dir == LL_SPI_HALF_DUPLEX_RX &&
			LL_SPI_GetMode(spi) == LL_SPI_MODE_MASTER) {
			LL_SPI_StartMasterTransfer(spi);
		}
#endif /* st_stm32h7_spi */

		if (ret != 0) {
			break;
		}

#if !DT_HAS_COMPAT_STATUS_OKAY(st_stm32h7_spi)

		/* toggle the DMA request to restart the transfer */
		if (transfer_dir == LL_SPI_FULL_DUPLEX) {
			LL_SPI_EnableDMAReq_RX(spi);
			LL_SPI_EnableDMAReq_TX(spi);
		} else if (transfer_dir == LL_SPI_HALF_DUPLEX_TX) {
			LL_SPI_EnableDMAReq_TX(spi);
		} else {
			LL_SPI_EnableDMAReq_RX(spi);
		}
#endif /* ! st_stm32h7_spi */

		ret = wait_dma_rx_tx_done(dev);
		if (ret != 0) {
			break;
		}

#ifdef SPI_SR_FTLVL
		while (LL_SPI_GetTxFIFOLevel(spi) > 0) {
		}
#endif /* SPI_SR_FTLVL */

